# CreateRoofStyle

## Description
Creates a new Roof Style of the given name. If the name is already in use, the next available name will be used.

```pascal
FUNCTION CreateRoofStyle(roofStyleName : STRING): HANDLE;
```

```python
def vs.CreateRoofStyle(roofStyleName):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|roofStyleName|STRING|The name of the new Roof Style.  If the name is already in use, the next available name will be used.|

## Examples
```pascal
resultH := CreateRoofStyle('Example');
```
```python
import vs

# Creates a new Roof Style of the given name.
roofStyleName = 'Example'

objHandle = vs.CreateRoofStyle(roofStyleName)
if objHandle is not None:
    vs.Message('Created object handle: ' + str(objHandle))
```

## Version
Availability: from Vectorworks 2016

## Category
* Objects - Architectural